ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32Arduino_WordClockV083/ESP32Arduino_WordClockV083.ino
/* 
 Author      : Ed Nieuwenhuys ednieuw.nl
 Changes V001: Derived from ESP32C3S3_WordClockV026.ino
 Changes V003: Clock and SK6812 LEDstrip working
...
 Changes V050: Only first 10 LEDs light up at startup instead of whole LED-string
 Changes V051: Moved In Setup() InitStorage() just after serial started. Setting were read too late  
 Changes V052: Violet startup Progress LEDs added
 Changes V053: Minors
 Changes V053: BLE delay(40) -> 10
 Changes V055: Fine tuned WIFIwasConnected. Minor changes 
               Identical common routines ESP32ArduinoFibonacci_V003 / ESP32WordClockUltimatePCB_V028 / ESP32WordClockV055
 Changes V056: MDNS.begin(BLEbroadcastName). Added  </style> in line 22 of webpage.h. Option Q3 and Q4 were reversed and corrected
 Changes V057: New design NLM1M2M3M4L94 --> NLM1M2M3M4L114
 Changes V058: Removed WhiteColour and --> white. void Laatzien(int Delaymsec). Last used Color in digital display. WIFI custom name in router
 Changes V059: Added KEYPAD3x1
 Changes V060: NimBLE version 1.4.3 -> 2.1.2 upgrade:
                void onConnect(BLEServer* pServer) {deviceConnected = true; };
                void onDisconnect(BLEServer* pServer) {deviceConnected = false;}
                void onWrite(BLECharacteristic *pCharacteristic) 
                To:
                void onConnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo) override {deviceConnected = true;Serial.println("Connected" ); };
                void onDisconnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo, int reason) override {deviceConnected = false;Serial.println("NOT Connected" );}
                void onWrite(NimBLECharacteristic *pCharacteristic, NimBLEConnInfo& connInfo) override  
                added: pAdvertising->setName(BLEbroadcastName);   after pAdvertising->addServiceUUID(SERVICE_UUID); 
 Changes V061: Added  NLM1M2M3M4L256. Added DS3231 OnOff in menu.
 Changes V062: Selftest(msec). NTP library https://github.com/gmag11/ESPNtpClient crashes with core 3.1.0
               R reset does not erase SSID, PWD and BLEstation but command RRR does erase SSID, PWD and BLEstation
               Removed extra CR, LF etc in ReworkInputString
 Changes V063: Removed WiFiGotIP() and to_upper()
 Changes V064: Added WIFI router credentials login page  
 Changes V065: Added Dynamic menu web page. Removed //sptext[0]=0 from tekstprint() . 
 Changes V066: Cleaning code  
 Changes V067: Stable
 Changes V068: Fancier web page. Documentation updated. RRR en RRRRR option for reset 
 Changes V069: Added Mem.WIFIcredentials to test if the SSID/PWD were set in AP-mode but were wrong. 
               After ESP32 restart the StartWordclock WIFI station will be restarted.
               Wire.begin(); // Keep Wire.begin close to the first I2C start to avoid WireTimeout()
 Changes V070: Added M1M2M3M4 in NL144. Added Option Q9 HET IS WAS on or Off
 Changes V071: Removed #include <ESPNtpClient.h>      // https://github.com/gmag11/ESPNtpClient
 Changes V072: German lay-out for single language clock
 Changes V073: Turned off WIFIevents
 Changes V074: ESP32 V3.2.0 and ADAfruit Neopixel 1.12.5 works.
 Changes V075: Added WPS (Option Z in menu) and added "remove WIFI Eventhandler" to stop the WIFI events WiFi.removeEvent(wifiEventHandler);
 Changes V076: Added Fire
 Changes V077: Own OTA added. Removed <ElegantOTA.h>
 Changes V078: WprintTekstln optimized
 Changes V079: OTA restart after update and back to Menu-html page
 Changes V080: cleanup
 Changes V081: Added 92 LEDs NL design. Minor changes in the menu. 
 Changes V082: Date-time in header HTML-page 
 Changes V083: Mem.PreExtraLEDs
//ToDo

- implement Change NTP_RTC in rotary
- Replace? NimBLE https://docs.espressif.com/projects/arduino-esp32/en/latest/api/ble.html
- 

How to compile: 
Install ESP32 boards
Board: Arduino Nano ESP32
Partition Scheme: With FAT
Pin Numbering: By GPIO number (legacy). Not 'By Arduino pin (default)'

Select below, with only one #define selected, the clock type

*/
// =============================================================================================================================
// ------------------>   Define only one clock type
//#define FOURLANGUAGECLOCK
//#define NL144CLOCK              // Dutch display for 12 x 12 Front
#define NL92CLOCK                 // Dutch display for one LED behinf every character
//#define DE144CLOCK              // German display for 12 x 12 Front
//#define NLM1M2M3M4L114          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L256          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L144          // NL clock with four extra LEDs for the minutes to light up 
//--------------------------------------------
// ESP32 Definition of installed modules
// Define the modules installed in the clock by removing the // before the #define
//--------------------------------------------
//#define ONEWIREKEYPAD3x1       // Use a 3x1 keypad with one wire
//#define ONEWIREKEYPAD3x4       // Use a 3x4 keypad with one wire
//--------------------------------------------
// ESP32 Includes defines and initialisations
//--------------------------------------------


#include <Preferences.h>
                      #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL (33, 0, 0) //Use EdSoftLED with ESP32 compiler until V3.2.0. Neopixel crashes>
#include <EdSoftLED.h>         // https://github.com/ednieuw/EdSoftLED for LED strip WS2812 or SK6812 
                      #else
#include <Adafruit_NeoPixel.h> // https://github.com/adafruit/Adafruit_NeoPixel   for LED strip WS2812 or SK6812
                      #endif
#include <NimBLEDevice.h>      // For BLE communication. !!!Use NimBLE version 2.x.x  https://github.com/h2zero/NimBLE-Arduino
#include <WiFi.h>              // Used for web page 
#include <AsyncTCP.h>          // Used for webpage  
#include "esp_sntp.h"          // for NTP
#include "esp_wps.h"           // For WPS
#include <ESPAsyncWebServer.h> // Used for webpage  https://github.com/mathieucarbou/ESPAsyncWebServer     Old original one https://github.com/me-no-dev/ESPAsyncWebServer
#include <Update.h>                               
#include <ESPmDNS.h>           // To show BLEname in router
#include <DNSServer.h>         // For the web page to enter SSID and password of the WIFI router 
#include <Wire.h>              // Ter zijner tijd Wire functies gaan gebruiken. Staan al klaar in de code 
#include <RTClib.h>            // Used for connected DS3231 RTC // Reference https://adafruit.github.io/RTClib/html/class_r_t_c___d_s3231.html
#include <Encoder.h>           // For rotary encoder
#include <Keypad.h>            // For 3x1 membrane keypad instead of rotary encoder by Mark Stanley & Alexander Brevig 


//------------------------------------------------------------------------------
// ARDUINO Definition of installed language word clock
//------------------------------------------------------------------------------
                     #ifdef FOURLANGUAGECLOCK
#define NL
#define UK
#define DE
#define FR    
                     #endif //FOURLANGUAGECLOCK
                     #ifdef NL144CLOCK
const uint32_t NUM_LEDS  =  144+4;                                    // How many leds in  strip? + 4 for the minutes
const byte MATRIX_WIDTH  =  12;                                       // Grid size For digital display mode.  
const byte MATRIX_HEIGHT =  12;                                       // Grid size For digital display mode.
// const uint32_t NUM_LEDS  =  256;   // Temporary for 16x16LED WS2812. To clear all LEDs. During uploading LEDs get randomly On and Off
// const byte MATRIX_WIDTH  =  16;                                    // Grid size For digital display mode.
// const byte MATRIX_HEIGHT =  16;                                    // Grid size For digital display mode.

#define HET     ColorLeds("Het",     0,   2, MINColor);   
#define IS      ColorLeds("is",      4,   5, SECColor);  ColorLeds("", 8,10, 0); Is = true;
#define WAS     ColorLeds("was",     8,  10, SECColor);  ColorLeds("", 4, 5, 0); Is = false;
#define PRECIES ColorLeds("precies", 17, 23, LetterColor);
#define MTIEN   ColorLeds("tien",    12, 15, LetterColor); 
#define MVIJF   ColorLeds("vijf",    25, 28, LetterColor); 
#define KWART   ColorLeds("kwart",   30, 34, LetterColor);
#define VOOR    ColorLeds("voor",    44, 47, LetterColor);
#define OVER    ColorLeds("over",    38, 41, LetterColor);
#define HALF    ColorLeds("half",    48, 51, LetterColor);
#define MIDDER  ColorLeds("midder",  53, 58, LetterColor);
#define VIJF    ColorLeds("vijf",    66, 69, LetterColor);
#define TWEE    ColorLeds("twee",    60, 63, LetterColor);
#define EEN     ColorLeds("een",     72, 74, LetterColor);
#define VIER    ColorLeds("vier",    77, 80, LetterColor);
#define TIEN    ColorLeds("tien",    91, 94, LetterColor);
#define TWAALF  ColorLeds("twaalf",  84, 89, LetterColor);
#define DRIE    ColorLeds("drie",    96, 99, LetterColor);
#define NEGEN   ColorLeds("negen",  102,106, LetterColor);
#define ACHT    ColorLeds("acht",   114,117, LetterColor);
#define NACHT   ColorLeds("nacht",  114,118, LetterColor);
#define ZES     ColorLeds("zes",    110,112, LetterColor);
#define ZEVEN   ColorLeds("zeven",  121,125, LetterColor);
#define ELF     ColorLeds("elf",    128,130, LetterColor);
#define NOEN    ColorLeds("noen",   139,142, LetterColor);
#define UUR     ColorLeds("uur",    134,136, LetterColor);
#define EDSOFT  ColorLeds("EdSoft", 132,132, LetterColor);
#define MIN1    ColorLeds("M1",     144,144, LetterColor); 
#define MIN2    ColorLeds("M2",     145,145, LetterColor);                                   // MINColor); 
#define MIN3    ColorLeds("M3",     146,146, LetterColor);
#define MIN4    ColorLeds("M4",     147,147, LetterColor);  
#define X_OFF   ColorLeds("",         0,  2, 0);
#define X_ON    ColorLeds("",         0,  2, LetterColor);
#define NTPT    ColorLed(139, orange);  ColorLed(137, orange);  ColorLed(117, orange);         // NTP
#define RTCT    ColorLed( 22, green);   ColorLed(  2, green);   ColorLed( 20, green);          // RTC
#define BLEONOFF ColorLed( 16, blue);   ColorLed( 81, blue);    ColorLed( 61, blue);           // BLE

                     #endif //NL144CLOCK
                     #ifdef NL92CLOCK
const uint32_t NUM_LEDS  =  92;                                  // How many leds in  strip?
const byte MATRIX_WIDTH  =  10;                                  // Grid size For digital display mode.  
const byte MATRIX_HEIGHT =  10;                                  // Grid size For digital display mode.

#define HET     ColorLeds("Het",     0,   2, MINColor); 
#define IS      ColorLeds("is",      3,   4, SECColor);  ColorLeds("", 5, 7, 0); Is = true;
#define WAS     ColorLeds("was",     5,   7, SECColor);  ColorLeds("", 3, 4, 0); Is = false;
#define MVIJF   ColorLeds("vijf",    12, 15, LetterColor); 
#define MTIEN   ColorLeds("tien",    8,  11, LetterColor);
#define KWART   ColorLeds("kwart",   16, 20, LetterColor);
#define VOOR    ColorLeds("voor",    21, 24, LetterColor);
#define OVER    ColorLeds("over",    32, 35, LetterColor);
#define PRECIES ColorLeds("precies", 25, 31, LetterColor);
#define HALF    ColorLeds("half",    36, 39, LetterColor);
#define ELF     ColorLeds("elf",     40, 42, LetterColor);
#define VIJF    ColorLeds("vijf",    47, 50, LetterColor);
#define TWEE    ColorLeds("twee",    43, 46, LetterColor);
#define EEN     ColorLeds("een",     51, 53, LetterColor);
#define VIER    ColorLeds("vier",    54, 57, LetterColor);
#define TIEN    ColorLeds("tien",    64, 67, LetterColor);
#define TWAALF  ColorLeds("twaalf",  58, 63, LetterColor);
#define DRIE    ColorLeds("drie",    68, 71, LetterColor);
#define NEGEN   ColorLeds("negen",   72, 76, LetterColor);
#define ACHT    ColorLeds("acht",    80, 83, LetterColor);
#define ZES     ColorLeds("zes",     77, 79, LetterColor);
#define ZEVEN   ColorLeds("zeven",   84, 88, LetterColor);
#define UUR     ColorLeds("uur",     89,91, LetterColor);
#define EDSOFT  ColorLeds("EdSoft",  92,92, LetterColor);
#define X_OFF   ColorLeds("",         0,  2, 0);
#define X_ON    ColorLeds("",         0,  2, LetterColor);
#define MIN1    ColorLeds("M1",     144,144, LetterColor); 
#define MIN2    ColorLeds("M2",     145,145, LetterColor);                                   // MINColor); 
#define MIN3    ColorLeds("M3",     146,146, LetterColor);
#define MIN4    ColorLeds("M4",     147,147, LetterColor);  
#define X_OFF   ColorLeds("",         0,  2, 0);
#define X_ON    ColorLeds("",         0,  2, LetterColor);
#define NTPT    ColorLed(139, orange);  ColorLed(137, orange);  ColorLed(117, orange);         // NTP
#define RTCT    ColorLed( 22, green);   ColorLed(  2, green);   ColorLed( 20, green);          // RTC
#define BLEONOFF ColorLed( 16, blue);   ColorLed( 81, blue);    ColorLed( 61, blue);           // BLE
                     #endif //NL92CLOCK

                     #ifdef DE144CLOCK
const uint32_t NUM_LEDS  =  144;                                    // How many leds in  strip? 
const byte MATRIX_WIDTH  =  12;                                       // Grid size For digital display mode.  
const byte MATRIX_HEIGHT =  12;                                       // Grid size For digital display mode.
#define ES      ColorLeds("Es",       1,   2, LetterColor);   
#define IST     ColorLeds("ist",      4,   6, LetterColor);  ColorLeds("", 8, 10, 0); Is = true;
#define WAR     ColorLeds("war",      8,  10, LetterColor);  ColorLeds("", 4,  6, 0); Is = false;
#define GENAU   ColorLeds("genau",   18,  22, LetterColor);
#define MZEHN   ColorLeds("zehn",    13,  16, LetterColor);
#define MFUNF   ColorLeds("funf",   383, 386, LetterColor);
#define VIERTEL ColorLeds("viertel",375, 381, LetterColor);
#define ZWANZIG ColorLeds("zwanzig",413, 419, LetterColor);
#define KURZ    ColorLeds("kurz",   421, 424, LetterColor);
#define VOR     ColorLeds("vor",    433, 435, LetterColor);
#define NACH    ColorLeds("nach",   427, 430, LetterColor);
#define HALB    ColorLeds("halb",   465, 468, LetterColor);
#define FUNF    ColorLeds("funf",   471, 474, LetterColor);
#define EINS    ColorLeds("eins",   483, 486, LetterColor);
#define VIERDE  ColorLeds("vier",   478, 481, LetterColor);
#define ZEHN    ColorLeds("zehn",   514, 517, LetterColor);
#define ZWOLF   ColorLeds("zwolf",  520, 524, LetterColor);
#define DREI    ColorLeds("drei",   532, 535, LetterColor);
#define NEUN    ColorLeds("neun",   526, 529, LetterColor);
#define ACHTDE  ColorLeds("acht",   565, 568, LetterColor);
#define SECHS   ColorLeds("sechs",  570, 574, LetterColor);
#define SIEBEN  ColorLeds("sieben", 580, 585, LetterColor);
#define ZWEI    ColorLeds("zwei",   575, 578, LetterColor);
#define ELFDE   ColorLeds("elf",    614, 616, LetterColor);
#define UHR     ColorLeds("uhr",    621, 623, LetterColor);
// Future use of characters to blink when a setting is choosen with the rotary encode 
#define NTPT    ColorLed(139, orange);  ColorLed(137, orange);  ColorLed(117, orange);         // NTP
#define RTCT    ColorLed( 22, green);   ColorLed(  2, green);   ColorLed( 20, green);          // RTC
#define BLEONOFF ColorLed( 16, blue);   ColorLed( 81, blue);    ColorLed( 61, blue);           // BLE
                     #endif //DE144CLOCK

                     #ifdef NLM1M2M3M4L114 

uint32_t NUM_LEDS  =  114 + 20;                                                          // How many leds in  strip? + Max 20 extra for the PreLeds in the strip stored in Mem.PreExtraLEDs
const byte MATRIX_WIDTH  =  11;                                                                // NA Not used in this clock. 10 is fine 
const byte MATRIX_HEIGHT =  10;                                                                // NA Not used in this clock. 10 is fine 
byte a = 0;
#define EDSOFT  ColorLeds("EdSoft",   0  ,   a-1, LetterColor);
#define HET a=Mem.PreExtraLEDs; ColorLeds("Het",      0+a,   2+a, MINColor);                   // Special adapted clock face
#define IS      ColorLeds("is",       4+a,   5+a, SECColor);     Is = true;                    // ColorLeds("", 4, 5, 0); 
#define WAS     ColorLeds("was",      4+a,   5+a, SECColor);     Is = false;                   // ColorLeds("", 4, 5, 0); 
#define MVIJF   ColorLeds("vijf",     7+a,  10+a, LetterColor); 
#define MVOOR   ColorLeds("voor",    11+a,  14+a, LetterColor);
#define MTIEN   ColorLeds("tien",    18+a,  21+a, LetterColor); 
#define OVER    ColorLeds("over",    22+a,  25+a, LetterColor);
#define KWART   ColorLeds("kwart",   28+a,  32+a, LetterColor);
#define OVER2   ColorLeds("over",    33+a,  36+a, LetterColor);
#define HALF    ColorLeds("half",    40+a,  43+a, LetterColor);
#define VOOR    ColorLeds("voor",    44+a,  47+a, LetterColor);
#define EEN     ColorLeds("een",     51+a,  53+a, LetterColor);
#define DRIE    ColorLeds("drie",    55+a,  58+a, LetterColor);
#define TWEE    ColorLeds("twee",    62+a,  65+a, LetterColor);
#define VIER    ColorLeds("vier",    66+a,  69+a, LetterColor);
#define VIJF    ColorLeds("vijf",    70+a,  73+a, LetterColor);
#define ZES     ColorLeds("zes",     74+a,  76+a, LetterColor);
#define NEGEN   ColorLeds("negen",   77+a,  81+a, LetterColor);
#define ZEVEN   ColorLeds("zeven",   83+a,  87+a, LetterColor);
#define ACHT    ColorLeds("acht",    88+a,  91+a, LetterColor);
#define TIEN    ColorLeds("tien",    92+a,  95+a, LetterColor);
#define ELF     ColorLeds("elf",     96+a,  98+a, LetterColor);
#define TWAALF  ColorLeds("twaalf", 104+a, 109+a, LetterColor);
#define UUR     ColorLeds("uur",     99+a, 101+a, LetterColor);
#define MIN1    ColorLeds("M1",     110+a, 110+a, LetterColor); 
#define MIN2    ColorLeds("M2",     111+a, 111+a, LetterColor);                                   // MINColor); 
#define MIN3    ColorLeds("M3",     112+a, 112+a, LetterColor);
#define MIN4    ColorLeds("M4",     113+a, 113+a, LetterColor);    
#define NTPT    ColorLed( 96+a, orange);  ColorLed( 97+a, orange);  ColorLed( 98, orange);        // NTP
#define RTCT    ColorLed( 22+a, green);   ColorLed( 23+a, green);   ColorLed( 24, green);         // RTC
#define BLEONOFF ColorLed( 80+a, blue);   ColorLed( 81+a, blue);    ColorLed( 82, blue);          // BLE

                     #endif //NLM1M2M3M4L114

                     #ifdef NLM1M2M3M4L144
const uint32_t NUM_LEDS  =  144;                                    // How many leds in  strip? + 4 for the minutes
const byte MATRIX_WIDTH  =  12;                                    // NA Not used in this clock. 10 is fine 
const byte MATRIX_HEIGHT =  12;                                    // NA Not used in this clock. 10 is fine 
                   
#define HET     ColorLeds("Het",      0,   4, MINColor);           // Special adapted clock face
#define IS      ColorLeds("is",       5,   7, SECColor);     Is = true;    //ColorLeds("", 4, 5, 0); 
#define WAS     ColorLeds("was",      5,   7, SECColor);     Is = false;  // ColorLeds("", 4, 5, 0); 
#define MVIJF   ColorLeds("vijf",     8,  13, LetterColor); 
#define MVOOR   ColorLeds("voor",    14,  19, LetterColor);
#define MTIEN   ColorLeds("tien",    20,  25, LetterColor); 
#define OVER    ColorLeds("over",    26,  31, LetterColor);
#define KWART   ColorLeds("kwart",   32,  39, LetterColor);
#define OVER2   ColorLeds("over",    39,  45, LetterColor);
#define HALF    ColorLeds("half",    46,  51, LetterColor);
#define VOOR    ColorLeds("voor",    52,  57, LetterColor);
#define EEN     ColorLeds("een",     58,  62, LetterColor);
#define DRIE    ColorLeds("drie",    63,  68, LetterColor);
#define TWEE    ColorLeds("twee",    69,  74, LetterColor);
#define VIER    ColorLeds("vier",    75,  80, LetterColor);
#define VIJF    ColorLeds("vijf",    81,  86, LetterColor);
#define ZES     ColorLeds("zes",     87,  91, LetterColor);
#define NEGEN   ColorLeds("negen",   92,  99, LetterColor);
#define ZEVEN   ColorLeds("zeven",  100, 107, LetterColor);
#define ACHT    ColorLeds("acht",   108, 113, LetterColor);
#define TIEN    ColorLeds("tien",   114, 119, LetterColor);
#define ELF     ColorLeds("elf",    120, 124, LetterColor);
#define TWAALF  ColorLeds("twaalf", 130, 139, LetterColor);
#define UUR     ColorLeds("uur",    125, 129, LetterColor);
#define MIN1    ColorLeds("M1",     140, 140, LetterColor); 
#define MIN2    ColorLeds("M2",     141, 141, LetterColor);       //MINColor); 
#define MIN3    ColorLeds("M3",     142, 142, LetterColor);
#define MIN4    ColorLeds("M4",     143, 143, LetterColor);    
#define NTPT    ColorLed(139, orange);  ColorLed(137, orange);  ColorLed(117, orange);         // NTP
#define RTCT    ColorLed( 22, green);   ColorLed(  2, green);   ColorLed( 20, green);          // RTC
#define BLEONOFF ColorLed( 16, blue);   ColorLed( 81, blue);    ColorLed( 61, blue);           // BLE
                     #endif //NLM1M2M3M4L144

                     #ifdef NLM1M2M3M4L256
const uint32_t NUM_LEDS  =  256;                                                              // How many leds in  strip? + 4 for the minutes
const byte MATRIX_WIDTH  =  16;                                                               // NA Not used in this clock. 16 is fine 
const byte MATRIX_HEIGHT =  16;                                                               // NA Not used in this clock. 16 is fine 
                 
