ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32Arduino_WordClockV083/ESP32Arduino_WordClockV083.ino
// #include <Adafruit_NeoPixel.h> // https://github.com/adafruit/Adafruit_NeoPixel   for LED strip WS2812 or SK6812

// // ==== MATRIX SETTINGS ====
// #define LED_PIN  8
// const uint32_t WIDTH = 16;
// const uint32_t HEIGHT = 16;
// const uint32_t NUM_LEDS = (WIDTH * HEIGHT);
// Adafruit_NeoPixel LEDstrip = Adafruit_NeoPixel(NUM_LEDS, LED_PIN, NEO_GRB  + NEO_KHZ800); // NEO_RGB NEO_GRB


// ==== FIRE EFFECT SETTINGS ====
#define COOLING     95
#define SPARKING    70
#define FIRE_DELAY  50

uint8_t heat[MATRIX_HEIGHT][MATRIX_WIDTH];  // 2D heat map

// ==== Utils ====
uint8_t clamp_sub(uint8_t val, uint8_t sub) {
  return (val > sub) ? (val - sub) : 0;
}

uint8_t clamp_add(uint8_t val, uint8_t add) {
  return (val + add > 255) ? 255 : (val + add);
}

void HeatColor(uint8_t temperature, uint8_t &r, uint8_t &g, uint8_t &b) {
  uint8_t t192 = (temperature * 192) / 255;
  uint8_t heatramp = (t192 & 0x3F) << 2;

  if (t192 > 128) {
    r = 255;
    g = 255;
    b = heatramp;
  } else if (t192 > 64) {
    r = 255;
    g = heatramp;
    b = 0;
  } else {
    r = heatramp;
    g = 0;
    b = 0;
  }
}

// Serpentine index mapping
uint16_t XY(uint8_t x, uint8_t y) {
  return (y % 2 == 0) ? (y * MATRIX_WIDTH + x) : (y * MATRIX_WIDTH + (MATRIX_WIDTH - 1 - x));
}

// ==== Fire Logic ====
void Fire2023_2D() {
  // Step 1: Cool down
  for (uint8_t x = 0; x < MATRIX_WIDTH; x++) {
    for (uint8_t y = 0; y < MATRIX_HEIGHT; y++) {
      heat[y][x] = clamp_sub(heat[y][x], random(0, ((COOLING * 10) / MATRIX_HEIGHT) + 2));
    }
  }

  // Step 2: Heat rises
  for (uint8_t x = 0; x < MATRIX_WIDTH; x++) {
for (int y = MATRIX_HEIGHT - 1; y >= 1; y--) {
  if (y == 1) {
    heat[y][x] = (heat[0][x] + heat[0][x]) / 2;  // Average with itself
  } else {
    heat[y][x] = (heat[y - 1][x] + heat[y - 2][x] + heat[y - 2][x]) / 3;
  }
}
  }

  // Step 3: Sparking at the bottom
  for (uint8_t x = 0; x < MATRIX_WIDTH; x++) {
    if (random(255) < SPARKING) {
      heat[0][x] = clamp_add(heat[0][x], random(160, 255));
    }
  }

  // Step 4: Draw pixels from heat map
  for (uint8_t y = 0; y < MATRIX_HEIGHT; y++) {
    for (uint8_t x = 0; x < MATRIX_WIDTH; x++) {
      uint8_t r, g, b;
      HeatColor(heat[y][x], r, g, b);
      LEDstrip.setPixelColor(XY(x, y), r, g, b, 0);  // Add W=0
    }
  }

  LEDstrip.show();
  delay(FIRE_DELAY);
}

// // ==== Setup ====
// void setup() {
//   LEDstrip.begin();
//   LEDstrip.setBrightness(16); 
//  // LEDstrip.fill(0, NUM_LEDS - 1, 0);  // Clear all LEDs
//   LEDstrip.clear();
//   LEDstrip.show();  
// }

// // ==== Main Loop ====
// void loop() {
//   Fire2023_2D();

// }
/*
void OTA_start(void) 
{
  // Serve the HTML
  server.on("/update", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send(200, "text/html", OTA_html);
  });

  // Handle OTA upload
  server.on("/update", HTTP_POST, [](AsyncWebServerRequest *request){
    bool success = !Update.hasError();
    request->send(200, "text/plain", success ? "OK" : "FAIL");
    delay(500);
    ESP.restart();
  }, [](AsyncWebServerRequest *request, String filename, size_t index,
        uint8_t *data, size_t len, bool final){

    if (!index) {
      Serial.printf("OTA Start: %s\n", filename.c_str());
      if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
        Update.printError(Serial);
      }
    }

    if (!Update.hasError()) {
      if (Update.write(data, len) != len) {
        Update.printError(Serial);
      }
    }

    if (final) {
      if (Update.end(true)) {
        Serial.printf("OTA Success: %u bytes\n", index + len);
      } else {
        Update.printError(Serial);
      }
    }
  });

  server.begin();
}
*/
